{"backend": "tensorflow", "config": [{"config": {"name": "masking_1", "dtype": "float32", "mask_value": -1, "trainable": true, "batch_input_shape": [null, 2, 28]}, "class_name": "Masking"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "implementation": 1, "units": 32, "recurrent_regularizer": null, "go_backwards": false, "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "activation": "tanh", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": false, "dropout": 0.2, "unroll": false, "dtype": "float32", "name": "lstm_1", "trainable": true, "recurrent_activation": "hard_sigmoid", "return_state": false, "bias_constraint": null, "stateful": false, "unit_forget_bias": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "batch_input_shape": [null, 2, 28]}, "class_name": "LSTM"}, {"config": {"activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 20, "dtype": "float32", "name": "dense_1", "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 32]}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.1.5", "class_name": "Sequential"}